TexasInstruments/ind-comms-sdk/examples/industrial_comms/ethercat_iolink_gateway_demo/am243x-lp/r5fss0-0_freertos/example.syscfg
led2.$name   = "CONFIG_LED_G_1";
led2.name    = "Ioexp";
led2.ioIndex = 1;

led3.name    = "Ioexp";
led3.ioIndex = 2;
led3.$name   = "CONFIG_LED_R_2";

led4.name    = "Ioexp";
led4.$name   = "CONFIG_LED_G_2";
led4.ioIndex = 3;

led5.name    = "Ioexp";
led5.$name   = "CONFIG_LED_R_3";
led5.ioIndex = 4;

led6.$name   = "CONFIG_LED_G_3";
led6.name    = "Ioexp";
led6.ioIndex = 5;

led7.$name   = "CONFIG_LED_R_4";
led7.name    = "Ioexp";
led7.ioIndex = 7;

led8.$name   = "CONFIG_LED_G_4";
led8.name    = "Ioexp";
led8.ioIndex = 6;

led9.$name   = "CONFIG_LED_R_5";
led9.name    = "Ioexp";
led9.ioIndex = 8;

led10.$name   = "CONFIG_LED_G_5";
led10.name    = "Ioexp";
led10.ioIndex = 9;

led11.$name   = "CONFIG_LED_R_6";
led11.name    = "Ioexp";
led11.ioIndex = 10;

led12.$name   = "CONFIG_LED_G_6";
led12.name    = "Ioexp";
led12.ioIndex = 11;

led13.$name   = "CONFIG_LED_R_7";
led13.name    = "Ioexp";
led13.ioIndex = 12;

led14.$name   = "CONFIG_LED_G_7";
led14.name    = "Ioexp";
led14.ioIndex = 13;

led15.$name   = "CONFIG_LED_R_8";
led15.name    = "Ioexp";
led15.ioIndex = 14;

led16.$name   = "CONFIG_LED_G_8";
led16.name    = "Ioexp";
led16.ioIndex = 15;

led17.$name = "CONFIG_LED_HEARTBEAT";
led17.name  = "TPIC2810";

led18.$name = "CONFIG_LED_STATUS";

led19.$name = "CONFIG_LED_ERROR";

led20.$name = "CONFIG_PHY0_RESET";

led21.$name = "CONFIG_PHY1_RESET";

gpio1.$name          = "CONFIG_IOL_TX1";
gpio1.pinDir         = "OUTPUT";
gpio1.GPIO_n.$assign = "PRG0_PRU0_GPO11";

gpio2.$name          = "CONFIG_IOL_TX2";
gpio2.pinDir         = "OUTPUT";
gpio2.GPIO_n.$assign = "PRG0_PRU0_GPO12";

gpio3.$name          = "CONFIG_IOL_TX3";
gpio3.pinDir         = "OUTPUT";
gpio3.GPIO_n.$assign = "PRG0_PRU0_GPO13";

gpio4.$name          = "CONFIG_IOL_TX4";
gpio4.pinDir         = "OUTPUT";
gpio4.pu_pd          = "pd";
gpio4.GPIO_n.$assign = "PRG0_PRU0_GPO14";

gpio5.$name          = "CONFIG_IOL_TX5";
gpio5.pinDir         = "OUTPUT";
gpio5.GPIO_n.$assign = "PRG0_PRU0_GPO15";

gpio6.$name          = "CONFIG_IOL_TX6";
gpio6.pinDir         = "OUTPUT";
gpio6.GPIO_n.$assign = "PRG0_PRU0_GPO16";

gpio7.$name          = "CONFIG_IOL_TX7";
gpio7.pinDir         = "OUTPUT";
gpio7.rx             = true;
gpio7.GPIO_n.$assign = "PRG0_PRU0_GPO17";

gpio8.$name          = "CONFIG_IOL_TX8";
gpio8.pinDir         = "OUTPUT";
gpio8.GPIO_n.$assign = "PRG0_PRU0_GPO18";

gpio9.$name          = "CONFIG_IOL_RX1";
gpio9.rx             = true;
gpio9.GPIO_n.$assign = "PRG0_PRU0_GPO0";

gpio10.$name          = "CONFIG_IOL_RX2";
gpio10.rx             = true;
gpio10.GPIO_n.$assign = "PRG0_PRU0_GPO1";

gpio11.$name          = "CONFIG_IOL_RX3";
gpio11.rx             = true;
gpio11.GPIO_n.$assign = "PRG0_PRU0_GPO2";

gpio12.$name          = "CONFIG_IOL_RX4";
gpio12.rx             = true;
gpio12.GPIO_n.$assign = "PRG0_PRU0_GPO3";

gpio13.$name          = "CONFIG_IOL_RX5";
gpio13.rx             = true;
gpio13.GPIO_n.$assign = "PRG0_PRU0_GPO4";

gpio14.$name          = "CONFIG_IOL_RX6";
gpio14.rx             = true;
gpio14.GPIO_n.$assign = "PRG0_PRU0_GPO5";

gpio15.$name          = "CONFIG_IOL_RX7";
gpio15.rx             = true;
gpio15.GPIO_n.$assign = "PRG0_PRU0_GPO6";

gpio16.$name          = "CONFIG_IOL_RX8";
gpio16.rx             = true;
gpio16.GPIO_n.$assign = "PRG0_PRU0_GPO7";

gpio17.$name          = "CONFIG_IOL_TXEN1";
gpio17.pinDir         = "OUTPUT";
gpio17.GPIO_n.$assign = "PRG0_PRU1_GPO15";

gpio18.$name          = "CONFIG_IOL_TXEN2";
gpio18.pinDir         = "OUTPUT";
gpio18.GPIO_n.$assign = "PRG0_PRU1_GPO16";

gpio19.$name          = "CONFIG_IOL_TXEN3";
gpio19.pinDir         = "OUTPUT";
gpio19.GPIO_n.$assign = "PRG0_MDIO0_MDIO";

gpio20.$name          = "CONFIG_IOL_TXEN4";
gpio20.pinDir         = "OUTPUT";
gpio20.GPIO_n.$assign = "PRG0_MDIO0_MDC";

gpio21.$name          = "CONFIG_IOL_TXEN5";
gpio21.pinDir         = "OUTPUT";
gpio21.GPIO_n.$assign = "SPI0_D0";

gpio22.$name          = "CONFIG_IOL_TXEN6";
gpio22.pinDir         = "OUTPUT";
gpio22.GPIO_n.$assign = "PRG1_PRU0_GPO17";

gpio23.$name          = "CONFIG_IOL_TXEN7";
gpio23.pinDir         = "OUTPUT";
gpio23.GPIO_n.$assign = "PRG1_PRU0_GPO18";

gpio24.$name          = "CONFIG_IOL_TXEN8";
gpio24.pinDir         = "OUTPUT";
gpio24.GPIO_n.$assign = "PRG1_PRU0_GPO19";

gpio25.$name          = "CONFIG_IOL_ENL1";
gpio25.pinDir         = "OUTPUT";
gpio25.GPIO_n.$assign = "PRG0_PRU0_GPO19";

gpio26.$name          = "CONFIG_IOL_ENL2";
gpio26.pinDir         = "OUTPUT";
gpio26.GPIO_n.$assign = "PRG0_PRU1_GPO0";

gpio27.$name          = "CONFIG_IOL_ENL3";
gpio27.pinDir         = "OUTPUT";
gpio27.GPIO_n.$assign = "PRG0_PRU1_GPO1";

gpio28.$name          = "CONFIG_IOL_ENL4";
gpio28.pinDir         = "OUTPUT";
gpio28.GPIO_n.$assign = "PRG0_PRU1_GPO2";

gpio29.$name          = "CONFIG_IOL_ENL5";
gpio29.pinDir         = "OUTPUT";
gpio29.GPIO_n.$assign = "PRG0_PRU1_GPO6";

gpio30.$name          = "CONFIG_IOL_ENL6";
gpio30.pinDir         = "OUTPUT";
gpio30.GPIO_n.$assign = "PRG0_PRU1_GPO11";

gpio31.$name          = "CONFIG_IOL_ENL7";
gpio31.pinDir         = "OUTPUT";
gpio31.GPIO_n.$assign = "PRG0_PRU1_GPO12";

gpio32.$name          = "CONFIG_IOL_ENL8";
gpio32.pinDir         = "OUTPUT";
gpio32.GPIO_n.$assign = "PRG0_PRU1_GPO13";

gpio33.$name           = "CONFIG_GPIO_LED_STATUS";
gpio33.pinDir          = "OUTPUT";
led18.peripheralDriver = gpio33;
gpio33.GPIO_n.$assign  = "GPMC0_AD7";

gpio34.$name           = "CONFIG_GPIO_LED_ERROR";
gpio34.pinDir          = "OUTPUT";
led19.peripheralDriver = gpio34;
gpio34.GPIO_n.$assign  = "MCAN0_TX";

gpio35.$name           = "CONFIG_GPIO0_PHYRESET0";
gpio35.pinDir          = "OUTPUT";
led20.peripheralDriver = gpio35;
gpio35.rx              = true;
gpio35.GPIO_n.$assign  = "GPMC0_AD13";

gpio36.$name           = "CONFIG_GPIO0_PHYRESET1";
gpio36.pinDir          = "OUTPUT";
led21.peripheralDriver = gpio36;
gpio36.GPIO_n.$assign  = "PRG1_PRU1_GPO18";

i2c1.$name               = "CONFIG_I2C0";
led17.peripheralDriver   = i2c1;
eeprom1.peripheralDriver = i2c1;
i2c1.I2C.$assign         = "I2C0";
i2c1.I2C.SCL.$assign     = "I2C0_SCL";
i2c1.I2C.SDA.$assign     = "I2C0_SDA";
i2c1.I2C_child.$name     = "drivers_i2c_v0_i2c_v0_template1";

i2c2.$name             = "CONFIG_I2C1";
led1.peripheralDriver  = i2c2;
led4.peripheralDriver  = i2c2;
led3.peripheralDriver  = i2c2;
led2.peripheralDriver  = i2c2;
led5.peripheralDriver  = i2c2;
led6.peripheralDriver  = i2c2;
led7.peripheralDriver  = i2c2;
led8.peripheralDriver  = i2c2;
led9.peripheralDriver  = i2c2;
led10.peripheralDriver = i2c2;
led11.peripheralDriver = i2c2;
led12.peripheralDriver = i2c2;
led13.peripheralDriver = i2c2;
led14.peripheralDriver = i2c2;
led15.peripheralDriver = i2c2;
led16.peripheralDriver = i2c2;
i2c2.I2C.$assign       = "I2C1";
i2c2.I2C.SCL.$assign   = "I2C1_SCL";
i2c2.I2C.SDA.$assign   = "I2C1_SDA";
i2c2.I2C_child.$name   = "drivers_i2c_v0_i2c_v0_template2";

mcspi1.$name                 = "CONFIG_MCSPI_IOL";
mcspi1.intrEnable            = "POLLED";
mcspi1.mcspiChannel[0].$name = "CONFIG_MCSPI_CH0";
mcspi1.child.$name           = "drivers_mcspi_v0_mcspi_v0_template0";

pruicss1.$name                           = "CONFIG_PRU_ICSS0";
pruicss1.AdditionalICSSSettings[0].$name = "CONFIG_PRU_ICSS_IO0";

uart1.readMode         = "CALLBACK";
uart1.writeMode        = "CALLBACK";
uart1.readCallbackFxn  = "vUartRxCallback";
uart1.writeCallbackFxn = "vUartTxCallback";
uart1.$name            = "CONFIG_UART_SMI";
uart1.UART.$assign     = "USART0";
uart1.UART.RXD.$assign = "UART0_RXD";
uart1.UART.TXD.$assign = "UART0_TXD";

uart2.$name = "CONFIG_UART_CONSOLE";

const uart_v0_template  = scripting.addModule("/drivers/uart/v0/uart_v0_template", {}, false);
const uart_v0_template1 = uart_v0_template.addInstance({}, false);
uart_v0_template1.$name = "drivers_uart_v0_uart_v0_template0";
uart1.child             = uart_v0_template1;
uart2.child             = uart_v0_template1;

const udma        = scripting.addModule("/drivers/udma/udma", {}, false);
const udma1       = udma.addInstance({}, false);
udma1.$name       = "CONFIG_UDMA0";
mcspi1.udmaDriver = udma1;

